app/controllers/chat_rooms_controller.rb

SELECT "chat_rooms".* FROM "chat_rooms"
---
  def index
    @chat_rooms = ChatRoomDecorator.decorate_collection(ChatRoom.all)

SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chat_room = ChatRoom.find( params[:id])